{"keras_version": "2.2.0", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"dropout": 0.0, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "return_state": false, "implementation": 1, "kernel_regularizer": null, "kernel_constraint": null, "dtype": "float32", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 40, "recurrent_constraint": null, "recurrent_dropout": 0.0, "bias_constraint": null, "trainable": true, "return_sequences": false, "activation": "tanh", "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "stateful": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 1, 5]}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.3, "seed": null, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "units": 1, "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1"}}]}