{"keras_version": "2.2.0", "config": [{"config": {"name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "kernel_constraint": null, "return_state": false, "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_sequences": false, "stateful": false, "bias_constraint": null, "unit_forget_bias": true, "use_bias": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "dropout": 0.0, "go_backwards": false, "units": 40, "kernel_regularizer": null, "activation": "tanh", "unroll": false, "recurrent_regularizer": null, "batch_input_shape": [null, 1, 5], "implementation": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"rate": 0.3, "name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 1, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}