{"keras_version": "2.2.0", "config": [{"config": {"unroll": false, "recurrent_constraint": null, "batch_input_shape": [null, 1, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "go_backwards": false, "recurrent_dropout": 0.0, "trainable": true, "stateful": false, "dropout": 0.0, "units": 40, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "activity_regularizer": null, "return_state": false, "implementation": 1, "return_sequences": false, "use_bias": true, "recurrent_regularizer": null, "kernel_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_constraint": null, "bias_constraint": null, "unit_forget_bias": true, "activation": "tanh"}, "class_name": "LSTM"}, {"config": {"seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_1", "units": 1, "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "activity_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}