{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "units": 4, "recurrent_dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "return_state": false, "bias_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "go_backwards": false, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "implementation": 1, "batch_input_shape": [null, 1, 5], "use_bias": true, "trainable": true, "dropout": 0.0, "activity_regularizer": null, "dtype": "float32", "unroll": false, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_2", "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "units": 16, "recurrent_dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "return_state": false, "bias_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "go_backwards": false, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "implementation": 1, "batch_input_shape": [null, 1, 5], "use_bias": true, "trainable": true, "dropout": 0.0, "activity_regularizer": null, "dtype": "float32", "unroll": false, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "LSTM", "config": {"name": "lstm_3", "recurrent_activation": "hard_sigmoid", "return_sequences": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "units": 64, "recurrent_dropout": 0.0, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "return_state": false, "bias_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "go_backwards": false, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "implementation": 1, "batch_input_shape": [null, 1, 5], "use_bias": true, "trainable": true, "dropout": 0.0, "activity_regularizer": null, "dtype": "float32", "unroll": false, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "rate": 0.3, "noise_shape": null, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 1, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null}}]}