{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "implementation": 1, "kernel_regularizer": null, "batch_input_shape": [null, 1, 5], "bias_constraint": null, "unroll": false, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "activity_regularizer": null, "return_state": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 40, "activation": "tanh", "bias_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "recurrent_regularizer": null, "stateful": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.3, "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "units": 1, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}], "keras_version": "2.2.0", "backend": "tensorflow"}