{"keras_version": "2.2.0", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "batch_input_shape": [null, 1, 5], "stateful": false, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "kernel_constraint": null, "go_backwards": false, "activation": "tanh", "implementation": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dtype": "float32", "return_state": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "activity_regularizer": null, "kernel_regularizer": null, "units": 4}}, {"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "batch_input_shape": [null, 1, 5], "stateful": false, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "kernel_constraint": null, "go_backwards": false, "activation": "tanh", "implementation": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dtype": "float32", "return_state": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "activity_regularizer": null, "kernel_regularizer": null, "units": 16}}, {"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "batch_input_shape": [null, 1, 5], "stateful": false, "use_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "kernel_constraint": null, "go_backwards": false, "activation": "tanh", "implementation": 1, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "dtype": "float32", "return_state": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "name": "lstm_3", "activity_regularizer": null, "kernel_regularizer": null, "units": 64}}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "bias_regularizer": null, "units": 1, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null}}]}