{"class_name": "Sequential", "keras_version": "2.2.0", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"stateful": false, "recurrent_constraint": null, "unit_forget_bias": true, "kernel_regularizer": null, "trainable": true, "units": 40, "recurrent_activation": "hard_sigmoid", "use_bias": true, "go_backwards": false, "name": "lstm_1", "dropout": 0.0, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "dtype": "float32", "recurrent_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "unroll": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "tanh", "recurrent_dropout": 0.0, "batch_input_shape": [null, 1, 5], "return_sequences": false, "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.3, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 1, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "activation": "linear", "bias_constraint": null}}]}