{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dtype": "float32", "trainable": true, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "unit_forget_bias": true, "activation": "tanh", "batch_input_shape": [null, 1, 5], "kernel_regularizer": null, "go_backwards": false, "return_state": false, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "return_sequences": false, "kernel_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "units": 40, "implementation": 1, "recurrent_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.3, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "units": 1, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true}}], "keras_version": "2.2.0", "backend": "tensorflow"}