{"config": [{"config": {"unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 40, "dropout": 0.0, "use_bias": true, "return_state": false, "bias_regularizer": null, "batch_input_shape": [null, 1, 5], "go_backwards": false, "dtype": "float32", "unroll": false, "implementation": 1, "bias_constraint": null, "return_sequences": false, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_constraint": null, "name": "lstm_1", "kernel_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "activity_regularizer": null, "activation": "tanh", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "rate": 0.3, "seed": null, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0"}