{"backend": "tensorflow", "config": [{"config": {"unit_forget_bias": true, "trainable": true, "return_state": false, "implementation": 1, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "tanh", "recurrent_dropout": 0.0, "unroll": false, "kernel_constraint": null, "units": 40, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "recurrent_regularizer": null, "stateful": false, "name": "lstm_1", "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "return_sequences": false, "batch_input_shape": [null, 1, 5], "dropout": 0.0, "recurrent_constraint": null, "kernel_regularizer": null}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "units": 1, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.0"}