{"config": [{"config": {"trainable": true, "bias_regularizer": null, "batch_input_shape": [null, 1, 5], "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "return_sequences": false, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "return_state": false, "unit_forget_bias": true, "unroll": false, "name": "lstm_1", "bias_constraint": null, "units": 40, "dropout": 0.0, "implementation": 1, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "stateful": false, "activation": "tanh", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.3, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_1", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.0", "backend": "tensorflow"}