{"config": [{"config": {"activation": "tanh", "activity_regularizer": null, "return_sequences": false, "recurrent_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "go_backwards": false, "batch_input_shape": [null, 1, 5], "recurrent_regularizer": null, "bias_constraint": null, "unroll": false, "kernel_constraint": null, "dtype": "float32", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "dropout": 0.0, "trainable": true, "recurrent_dropout": 0.0, "stateful": false, "recurrent_activation": "hard_sigmoid", "units": 40, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "lstm_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "implementation": 1}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.3, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "units": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "keras_version": "2.2.0", "class_name": "Sequential", "backend": "tensorflow"}