{"backend": "tensorflow", "keras_version": "2.2.0", "config": [{"config": {"dtype": "float32", "return_state": false, "implementation": 1, "bias_regularizer": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_regularizer": null, "stateful": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "use_bias": true, "activation": "tanh", "trainable": true, "units": 40, "kernel_constraint": null, "activity_regularizer": null, "name": "lstm_1", "bias_constraint": null, "return_sequences": false, "dropout": 0.0, "batch_input_shape": [null, 1, 5], "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_regularizer": null, "units": 1, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}