{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"trainable": true, "use_bias": true, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_1", "return_state": false, "dtype": "float32", "bias_regularizer": null, "batch_input_shape": [null, 5, 1], "dropout": 0.0, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "units": 4, "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "stateful": false, "kernel_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"trainable": true, "use_bias": true, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_2", "return_state": false, "dtype": "float32", "bias_regularizer": null, "batch_input_shape": [null, 5, 1], "dropout": 0.0, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "units": 16, "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "stateful": false, "kernel_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh"}}, {"class_name": "LSTM", "config": {"trainable": true, "use_bias": true, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_3", "return_state": false, "dtype": "float32", "bias_regularizer": null, "batch_input_shape": [null, 5, 1], "dropout": 0.0, "unroll": false, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_regularizer": null, "units": 64, "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "stateful": false, "kernel_regularizer": null, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "rate": 0.3, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_1", "kernel_regularizer": null, "activation": "linear"}}], "backend": "tensorflow", "keras_version": "2.2.0"}