{"config": [{"config": {"stateful": false, "dtype": "float32", "dropout": 0.0, "units": 4, "activation": "tanh", "return_state": false, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 1, 1], "recurrent_constraint": null, "return_sequences": true, "unroll": false, "name": "lstm_1", "recurrent_regularizer": null, "implementation": 1, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "activity_regularizer": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"stateful": false, "dtype": "float32", "dropout": 0.0, "units": 16, "activation": "tanh", "return_state": false, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 1, 1], "recurrent_constraint": null, "return_sequences": true, "unroll": false, "name": "lstm_2", "recurrent_regularizer": null, "implementation": 1, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "activity_regularizer": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"stateful": false, "dtype": "float32", "dropout": 0.0, "units": 64, "activation": "tanh", "return_state": false, "use_bias": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "kernel_constraint": null, "batch_input_shape": [null, 1, 1], "recurrent_constraint": null, "return_sequences": false, "unroll": false, "name": "lstm_3", "recurrent_regularizer": null, "implementation": 1, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "activity_regularizer": null, "trainable": true, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "seed": null, "rate": 0.3, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_1", "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.0"}