{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "return_sequences": true, "trainable": true, "stateful": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 1, 5], "dropout": 0.0, "name": "lstm_1", "dtype": "float32", "units": 4, "activity_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "activation": "tanh", "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "implementation": 1}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "return_sequences": true, "trainable": true, "stateful": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 1, 5], "dropout": 0.0, "name": "lstm_2", "dtype": "float32", "units": 16, "activity_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "activation": "tanh", "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "implementation": 1}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "return_sequences": false, "trainable": true, "stateful": false, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "bias_regularizer": null, "batch_input_shape": [null, 1, 5], "dropout": 0.0, "name": "lstm_3", "dtype": "float32", "units": 64, "activity_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "activation": "tanh", "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "implementation": 1}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.3}}, {"class_name": "Dense", "config": {"use_bias": true, "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "units": 1}}], "keras_version": "2.2.0", "backend": "tensorflow"}