{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"stateful": false, "implementation": 1, "return_sequences": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "dropout": 0.0, "use_bias": true, "unroll": false, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "unit_forget_bias": true, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "go_backwards": false, "units": 4, "batch_input_shape": [null, 1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "lstm_1", "return_state": false, "activation": "tanh", "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "LSTM", "config": {"stateful": false, "implementation": 1, "return_sequences": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "dropout": 0.0, "use_bias": true, "unroll": false, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "unit_forget_bias": true, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "go_backwards": false, "units": 16, "batch_input_shape": [null, 1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "lstm_2", "return_state": false, "activation": "tanh", "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "LSTM", "config": {"stateful": false, "implementation": 1, "return_sequences": false, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "dropout": 0.0, "use_bias": true, "unroll": false, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "unit_forget_bias": true, "dtype": "float32", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_regularizer": null, "go_backwards": false, "units": 64, "batch_input_shape": [null, 1, 1], "bias_regularizer": null, "bias_constraint": null, "name": "lstm_3", "return_state": false, "activation": "tanh", "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.3}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "name": "dense_1", "kernel_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}], "keras_version": "2.2.0"}