{"keras_version": "2.2.0", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"unroll": false, "units": 4, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "name": "lstm_1", "dtype": "float32", "kernel_regularizer": null, "bias_regularizer": null, "activation": "tanh", "dropout": 0.0, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "batch_input_shape": [null, 1, 1], "recurrent_dropout": 0.0, "recurrent_regularizer": null, "return_sequences": true, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"unroll": false, "units": 16, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "name": "lstm_2", "dtype": "float32", "kernel_regularizer": null, "bias_regularizer": null, "activation": "tanh", "dropout": 0.0, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "batch_input_shape": [null, 1, 1], "recurrent_dropout": 0.0, "recurrent_regularizer": null, "return_sequences": true, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"unroll": false, "units": 64, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "name": "lstm_3", "dtype": "float32", "kernel_regularizer": null, "bias_regularizer": null, "activation": "tanh", "dropout": 0.0, "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "bias_constraint": null, "recurrent_constraint": null, "batch_input_shape": [null, 1, 1], "recurrent_dropout": 0.0, "recurrent_regularizer": null, "return_sequences": false, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.3, "trainable": true, "seed": null, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "units": 1, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "trainable": true}}], "backend": "tensorflow"}